<a href="https://colab.research.google.com/github/Mstfayldz/Data-Science/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [105]:
import numpy as np

In [106]:
import pandas as pd

In [107]:
# pip install pandas eer yüklü değilse

# SERIES ==> tek column arraylar için one dimension

In [108]:
grades={"Atil":50,"James":60,"Lars":70}

In [109]:
print(pd.Series(grades))

Atil     50
James    60
Lars     70
dtype: int64

In [110]:
names=["Atil","James","Lars"]

In [111]:
print(pd.Series(names))

0     Atil
1    James
2     Lars
dtype: object

In [112]:
grade=[50,60,70]

In [113]:
print(pd.Series(data=grade, index=names))

Atil     50
James    60
Lars     70
dtype: int64

In [114]:
#with numpy

In [115]:
np_array=np.array([50,60,70])

In [116]:
print(pd.Series(np_array))

0    50
1    60
2    70
dtype: int64

aritmetic

In [117]:
contest_result=pd.Series(data=[10,5,100], index=["Atil","James","Lars"])
contest_result2=pd.Series(data=[20,15,10], index=["Atil","James","Lars"])

In [118]:
print(contest_result)

Atil      10
James      5
Lars     100
dtype: int64

In [119]:
print(contest_result["Atil"])

10

In [120]:
final=contest_result+contest_result2
print(final)
print(final/2)

Atil      30
James     20
Lars     110
dtype: int64
Atil     15.0
James    10.0
Lars     55.0
dtype: float64

In [121]:
print(contest_result*contest_result2)

Atil      200
James      75
Lars     1000
dtype: int64

In [122]:
#indexler arasında farklılık olursa nasıl olur
different_index=pd.Series(data=[10,5,100,24], index=["a","b","c","f"])
different_index2=pd.Series(data=[20,15,10,35], index=["a","c","d","e"])

In [123]:
different_index_result=different_index+different_index2  #aynı indexleri bulursa işlemi yapar bulamadıklarına NaN döner
print(different_index_result)

a     30.0
b      NaN
c    115.0
d      NaN
e      NaN
f      NaN
dtype: float64

# DataFrame ==> boyutu birden fazla olan arraylar için . Seriesların birleşiminden oluşur

In [124]:
data= np.random.randint(10,100,size=(4,3))

In [125]:
data

array([[44, 66, 68],
       [37, 97, 75],
       [71, 72, 92],
       [94, 14, 44]], dtype=int32)

In [126]:
data_frame=pd.DataFrame(data)

In [127]:
data_frame

    0   1   2
0  44  66  68
1  37  97  75
2  71  72  92
3  94  14  44

In [128]:
data_frame[0]

0    44
1    37
2    71
3    94
Name: 0, dtype: int32

In [129]:
print(type(data_frame))
print(type(data_frame[0]))#burdan seriesların DataFramlerin temeli olduğunu anlıyoruz

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [130]:
new_df=pd.DataFrame(data,index=["Mustafa","Ali","Talha","Ercan"], columns=["Salary","Age","Experience"])

In [131]:
new_df

         Salary  Age  Experience
Mustafa      44   66          68
Ali          37   97          75
Talha        71   72          92
Ercan        94   14          44

In [132]:
new_df["Age"]

Mustafa    66
Ali        97
Talha      72
Ercan      14
Name: Age, dtype: int32

In [133]:
new_df[["Salary","Age"]]

         Salary  Age
Mustafa      44   66
Ali          37   97
Talha        71   72
Ercan        94   14

In [134]:
# row içinse:
new_df.loc["Mustafa"]

Salary        44
Age           66
Experience    68
Name: Mustafa, dtype: int32

In [135]:
#eğer row isim değilde saı olursa
new_df.iloc[1]

Salary        37
Age           97
Experience    75
Name: Ali, dtype: int32

In [136]:
new_df.iloc[:,1]#burda da ":"=> demek columnların hepsini al ","=> columnların içinden belrteceğim indexi al

Mustafa    66
Ali        97
Talha      72
Ercan      14
Name: Age, dtype: int32

# DATA MANIPULATION

In [137]:
new_df["Ekstra"]=10 # column ekleme . ama bu şekilde bütün satırlara(row) aynı değeri atar

In [138]:
new_df

         Salary  Age  Experience  Ekstra
Mustafa      44   66          68      10
Ali          37   97          75      10
Talha        71   72          92      10
Ercan        94   14          44      10

In [139]:
#silme/düşürme
new_df.drop("Ekstra", axis=1, inplace=True) # burda axis=0==> row axis=1==> columnda ekstra yı bul ve düşür demek eğer columnda ve row da aynı isimde değişken olsaydı ve axisi belirtmemiş olsaydık row u silerdi inpalace=True ==> ise bu işlemi new_df in içinde yap demek
# şu şekilde de yapılabilir
# new_df=new_df.drop("Ekstra", axis=1)

In [140]:
new_df

         Salary  Age  Experience
Mustafa      44   66          68
Ali          37   97          75
Talha        71   72          92
Ercan        94   14          44

In [141]:
new_df.loc["Mustafa"]["Salary"]
# new_df.loc["Mustafa","Salary"] aynı işlevi görür

np.int32(44)

In [142]:
new_df.loc["Mustafa","Salary"]=100 # spesifik veri değiştirme

In [143]:
new_df

         Salary  Age  Experience
Mustafa     100   66          68
Ali          37   97          75
Talha        71   72          92
Ercan        94   14          44

In [144]:
new_df >20

         Salary    Age  Experience
Mustafa    True   True        True
Ali        True   True        True
Talha      True   True        True
Ercan      True  False        True

In [145]:
new_df[new_df>20]

         Salary   Age  Experience
Mustafa     100  66.0          68
Ali          37  97.0          75
Talha        71  72.0          92
Ercan        94   NaN          44

In [146]:
new_df[new_df["Salary"]>50] # maaşı 50 den büyük olanlar

         Salary  Age  Experience
Mustafa     100   66          68
Talha        71   72          92
Ercan        94   14          44

In [147]:
new_df["Age"][new_df["Salary"]>50]# maaşı 50 den büyük olanların yaşını ver

Mustafa    66
Talha      72
Ercan      14
Name: Age, dtype: int32

In [148]:
new_df.Experience[new_df["Salary"]>50]

Mustafa    68
Talha      92
Ercan      44
Name: Experience, dtype: int32

# DataFrame Index Mantığı

In [149]:
reset_frame=new_df.reset_index() # indexleri sıralar

In [150]:
reset_frame

     index  Salary  Age  Experience
0  Mustafa     100   66          68
1      Ali      37   97          75
2    Talha      71   72          92
3    Ercan      94   14          44

In [ ]:
new_df.iloc[0]

Salary        100
Age            66
Experience     68
Name: Mus, dtype: int32

In [152]:
reset_frame.loc[0]

index         Mustafa
Salary            100
Age                66
Experience         68
Name: 0, dtype: object

row isim değiştirme

In [153]:
new_index=["Mus","Al","Tal","Erc"]

In [154]:
new_df["new_index"]=new_index

In [155]:
new_df.set_index("new_index", inplace=True)

In [156]:
new_df

           Salary  Age  Experience
new_index
Mus           100   66          68
Al             37   97          75
Tal            71   72          92
Erc            94   14          44

Multi index

In [157]:
first_index=["Simpsion","Simpsion","Simpsion","South Park","South Park","South Park"]
inner_index=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [158]:
zipped_index=list(zip(first_index,inner_index))

In [159]:
zipped_index

[('Simpsion', 'Homer'),
 ('Simpsion', 'Bart'),
 ('Simpsion', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [160]:
zipped_index=pd.MultiIndex.from_tuples(zipped_index)

In [161]:
zipped_index

MultiIndex([(  'Simpsion',   'Homer'),
            (  'Simpsion',    'Bart'),
            (  'Simpsion',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [162]:
sample_values= np.ones((6,2))

In [163]:
multi_frame=pd.DataFrame(sample_values, index=zipped_index, columns=["A","B"])

In [164]:
multi_frame

                      A    B
Simpsion   Homer    1.0  1.0
           Bart     1.0  1.0
           Marge    1.0  1.0
South Park Cartman  1.0  1.0
           Kenny    1.0  1.0
           Kyle     1.0  1.0

In [165]:
multi_frame.loc["Simpsion"].loc["Homer"]

A    1.0
B    1.0
Name: Homer, dtype: float64